@echo off
title VOXEL SANBOX LAUNCHER
echo ===================================================
echo [1/3] Запуск авторитарного UDP сервера...
echo ===================================================
start "VOXEL SERVER" python vox_server.py

:: Небольшая пауза в 1 секунду, чтобы сервер успел занять порт 9999
timeout /t 1 /nobreak >nul

echo ===================================================
echo [2/3] Запуск первого игрового клиента (Игрок 1)...
echo ===================================================
start "VOXEL CLIENT - PLAYER 1" python vox_destruction.py

:: Пауза 0.5 секунды во избежание конфликта инициализации ModernGL контекстов
timeout /t 1 /nobreak >nul

echo ===================================================
echo [3/3] Запуск второго игрового клиента (Игрок 2)...
echo ===================================================
start "VOXEL CLIENT - PLAYER 2" python vox_destruction.py

echo ===================================================
echo Все процессы успешно запущены! Мультиплеер готов.
echo ===================================================
exit
